tests/load/performance.yml
config:
  target: 'http://localhost:8000'
  phases:
    - duration: 60
      arrivalRate: 10
      name: "Warm up"
    - duration: 120
      arrivalRate: 50
      name: "Ramp up load"
    - duration: 60
      arrivalRate: 100
      name: "Sustained load"
  defaults:
    headers:
      Content-Type: "application/json"

scenarios:
  - name: "API Load Test"
    flow:
      - get:
          url: "/api/bills"
          headers:
            Authorization: "Bearer {{ $processEnvironment.TEST_TOKEN }}"
      - think: 1
      - get:
          url: "/api/customers"
          headers:
            Authorization: "Bearer {{ $processEnvironment.TEST_TOKEN }}"
      - think: 1
      - get:
          url: "/api/payments"
          headers:
            Authorization: "Bearer {{ $processEnvironment.TEST_TOKEN }}"